[
  {
    "id": 1,
    "title": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "price": 15.99,
    "image": "img/Thegreatgatsby.jpeg",
    "category": "Fiction",
    "description": "The Great Gatsby is a classic novel set in the Jazz Age of the 1920s. It tells the story of Jay Gatsby, a mysterious millionaire who is known for his extravagant parties and obsessive love for Daisy Buchanan, a woman he met and fell in love with during World War I. Narrated by Nick Carraway, Daisy's cousin, the novel explores themes of the American Dream, class, and disillusionment. Gatsby’s relentless pursuit of an idealized past leads to tragic consequences, making the novel a poignant commentary on the emptiness behind wealth and the pursuit of happiness in a materialistic society.",
    "sku": "SKU12345",
    "stock_status": "In Stock"
  },
  {
    "id": 2,
    "title": "1984",
    "author": " George Orwell",
    "price": 12.99,
    "image": "img/1984.webp",
    "category": "Dystopian",
    "description": "1984 is a dystopian novel set in a totalitarian society controlled by a powerful and oppressive regime led by the Party, with Big Brother as its symbolic figurehead. The protagonist, Winston Smith, works for the Party rewriting history to align with its ever-changing narrative. Despite living under constant surveillance, Winston begins to rebel against the Party’s control, seeking truth and freedom. The novel explores themes of surveillance, censorship, the manipulation of truth, and the loss of individuality. Orwell's haunting portrayal of a world where freedom is crushed under an authoritarian regime remains a chilling warning about the dangers of totalitarianism and the suppression of dissent.",
    "sku": "SKU12346",
    "stock_status": "Out of Stock"
  },
  {
    "id": 3,
    "title": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "price": 14.50,
    "image": "img/tokillamokingbird.jpg",
    "category": "Classic",
    "description": "To Kill a Mockingbird is a novel set in the 1930s in the fictional town of Maycomb, Alabama. It is narrated by Scout Finch, a young girl, who watches her father, Atticus Finch, a principled lawyer, defend Tom Robinson, a Black man falsely accused of raping a white woman. As the trial unfolds, Scout and her brother, Jem, confront the deep-seated racism and injustice that permeate their community. The novel explores themes of racial inequality, moral growth, empathy, and the loss of innocence. Atticus Finch’s unwavering moral compass and commitment to justice make him an enduring symbol of integrity in the face of prejudice.",
    "sku": "SKU12347",
    "stock_status": "In Stock"
  },
  {
    "id": 4,
    "title": "Harry Potter and the Sorcerer's Stone",
    "author": " J.K. Rowling",
    "price": 18.99,
    "image": "img/harrypotter.jpg",
    "category": "Fantasy",
    "description": "Harry Potter and the Sorcerer's Stone is the first book in the iconic Harry Potter series. It introduces Harry, an orphaned boy who discovers on his 11th birthday that he is a wizard. Harry is taken to Hogwarts School of Witchcraft and Wizardry, where he begins to learn magic and uncovers the mystery behind his parents’ deaths. ",
    "sku": "SKU12348",
    "stock_status": "In Stock"
  },
  {
    "id": 5,
    "title": "The Hobbit",
    "author": " J.R.R. Tolkien",
    "price": 20.00,
    "image": "img/thehobbit.jpg",
    "category": "Fantasy",
    "description": "The Hobbit is a fantasy novel that follows the journey of Bilbo Baggins, a hobbit from the peaceful Shire, who is unexpectedly swept into an adventure with a group of dwarves and the wizard Gandalf. The group embarks on a quest to reclaim the Lonely Mountain and its treasure, which has been stolen by the fearsome dragon Smaug",
    "sku": "SKU12349",
    "stock_status": "In Stock"
  },
  {
    "id": 6,
    "title": "Pride and Prejudice",
    "author": "Jane Austen",
    "price": 10.99,
    "image": "img/pride.jpg",
    "category": "Romance",
    "description": "Pride and Prejudice is a beloved classic that follows the life of Elizabeth Bennet, the intelligent and headstrong second daughter of the Bennet family, in early 19th-century England. The novel explores her evolving relationship with the wealthy and aloof Mr. Darcy. Initially, Elizabeth forms a negative opinion of Darcy due to his pride and perceived arrogance, while Darcy struggles with his own prejudice against her lower social standing",
    "sku": "SKU12350",
    "stock_status": "Out of Stock"
  },
  {
    "id": 7,
    "title": "Moby-Dick",
    "author": "Herman Melville",
    "price": 17.99,
    "image": "img/mobydick.jpg",
    "category": "Adventure",
    "description": "Moby-Dick is an epic tale of obsession and revenge, following the journey of Ishmael, a sailor who joins the whaling ship Pequod, captained by the enigmatic and vengeful Captain Ahab. Ahab's sole purpose is to hunt down Moby Dick, a massive white whale that had previously maimed him. As the crew sails across the world's oceans, Ishmael narrates the dangers and wonders of whaling, while also exploring philosophical themes of fate, nature, and humanity’s struggle against the unknown",
    "sku": "SKU12351",
    "stock_status": "In Stock"
  },
  {
    "id": 8,
    "title": "The Catcher in the Rye",
    "author": " J.D. Salinger",
    "price": 13.99,
    "image": "img/thecatcherintherye.jpg",
    "category": "Coming-of-age",
    "description": "The Catcher in the Rye follows the story of Holden Caulfield, a disillusioned and rebellious teenager who has been expelled from several prep schools. The novel is narrated by Holden himself, who reflects on his life, his feelings of alienation, and his struggle to find a place in a world he feels disconnected from",
    "sku": "SKU12352",
    "stock_status": "Out of Stock"
  },
  {
    "id": 9,
    "title": "The Silent Patient",
    "author": "Alex Michaelides",
    "price": 14.99,
    "image": "img/thesilentpatient.jpg",
    "category": "Mystery",
    "description": "A chilling psychological thriller that follows Alicia Berenson, a celebrated painter who is accused of shooting her husband. After the murder, she becomes mute, leaving everyone to question her motives. Theo Faber, a forensic psychologist, becomes obsessed with uncovering the truth behind her silence. As he delves deeper into her past, he discovers shocking revelations that change everything.",
    "sku": "SKU12353",
    "stock_status": "In Stock"
  },  
  {
    "id": 10,
    "title": "Dune",
    "author": "Frank Herbert",
    "price": 16.99,
    "image": "img/dune.jpg",
    "category": "Science Fiction",
    "description": "A monumental epic that explores the themes of politics, religion, and ecology on the desert planet Arrakis. Paul Atreides, the young heir to the noble House Atreides, is thrust into a battle for control of the most valuable substance in the universe: the spice melange. As he navigates treachery and power struggles, Paul must confront his destiny. *Dune* is a masterwork of science fiction that delves into the complexities of power and survival.",
    "sku": "SKU12354",
    "stock_status": "Out of Stock"
  },  
  {
    "id": 11,
    "title": "The Night Circus",
    "author": "Erin Morgenstern",
    "price": 19.99,
    "image": "img/The Night Circus.jpg",
    "category": "Fantasy",
    "description": "A captivating fantasy novel set around a magical circus that only opens at night. The circus, known as Le Cirque des Rêves, is a place of wonder and enchantment, where two young illusionists, Celia and Marco, engage in a mystical competition. As their rivalry intensifies, the circus becomes a battleground of both magic and love. *The Night Circus* weaves together mystery, romance, and rich storytelling, making it a mesmerizing experience.",
    "sku": "SKU12355",
    "stock_status": "In Stock"
  },  
  {
    "id": 12,
    "title": "My Journey from Doubt to Belief",
    "author": "Mostafa Mahmoud",
    "price": 39.99,
    "image": "img/My Journey from Doubt to Belief.jpg",
    "category": "Philosophy",
    "description": "In *My Journey from Doubt to Belief (رحلتي من الشك إلى الإيمان)*, Mostafa Mahmoud reflects on his personal intellectual and spiritual journey. He grapples with doubt, skepticism, and the search for truth, exploring philosophical, scientific, and religious concepts. The book documents Mahmoud’s transformation from uncertainty to a firm conviction in faith, offering profound insights into the nature of belief and human existence. It is an exploration of the intersection between reason, spirituality, and the quest for meaning.",
    "sku": "SKU12356",
    "stock_status": "Out of Stock"
  } ,
    {
      "id": 13,
      "title": "Dialogue with an Atheist",
      "author": "Mostafa Mahmoud",
      "price": 10.99,
      "image": "img/Dialogue with an Atheist.jpg",
      "category": "Philosophy",
      "description": "In this thought-provoking dialogue, Mostafa Mahmoud engages with an atheist to explore profound questions about faith, existence, and the nature of belief. The book delves into deep philosophical debates, examining skepticism and the search for truth.",
      "sku": "SKU12357",
      "stock_status": "In Stock"
    },
    {
      "id": 14,
      "title": "Brave New World",
      "author": "Aldous Huxley",
      "price": 13.99,
      "image": "img/Brave New World.jpg",
      "category": "Dystopian Fiction",
      "description": "Set in a futuristic society where technological advancements have eliminated war and suffering, *Brave New World* critiques the loss of individuality and personal freedom. The novel explores the consequences of societal control, mass production, and genetic engineering.",
      "sku": "SKU12358",
      "stock_status": "In Stock"
    },
    {
      "id": 15,
      "title": "The Hunger Games",
      "author": "Suzanne Collins",
      "price": 14.99,
      "image": "img/hungergames.jpg",
      "category": "Dystopian Fiction",
      "description": "In a totalitarian society, the government forces each district to send children to participate in a televised fight to the death. The protagonist, Katniss Everdeen, volunteers to take her sister’s place, sparking a rebellion that challenges the oppressive regime.",
      "sku": "SKU12359",
      "stock_status": "In Stock"
    },
    {
      "id": 16,
      "title": "The Girl with the Dragon Tattoo",
      "author": "Stieg Larsson",
      "price": 11.99,
      "image": "img/The Girl with the Dragon Tattoo.jpg",
      "category": "Mystery",
      "description": "A gripping mystery about investigative journalist Mikael Blomkvist and hacker Lisbeth Salander, who team up to uncover long-buried family secrets and expose a network of corruption and abuse.",
      "sku": "SKU12360",
      "stock_status": "Out of Stock"
    },
    {
      "id": 17,
      "title": "The Alchemist",
      "author": "Paulo Coelho",
      "price": 12.99,
      "image": "img/The Alchemist.jpg",
      "category": "Adventure",
      "description": "A young shepherd named Santiago sets out on an adventurous journey to find treasure and in the process learns the deeper meaning of life, spirituality, and the importance of following one's dreams.",
      "sku": "SKU12361",
      "stock_status": "In Stock"
    },
    {
      "id": 18,
      "title": "The Road",
      "author": "Cormac McCarthy",
      "price": 16.50,
      "image": "img/theroad.jpg",
      "category": "Post-Apocalyptic",
      "description": "In a bleak and desolate post-apocalyptic world, a father and his son embark on a dangerous journey to survive, clinging to love and hope amidst the overwhelming devastation around them.",
      "sku": "SKU12362",
      "stock_status": "In Stock"
    },
    {
      "id": 19,
      "title": "Gone with the Wind",
      "author": "Margaret Mitchell",
      "price": 17.00,
      "image": "img/Gone with the Wind.webp",
      "category": "Historical Fiction",
      "description": "Set against the backdrop of the American Civil War and Reconstruction, *Gone with the Wind* follows the passionate, turbulent love story of Scarlett O'Hara and Rhett Butler, as they navigate loss, survival, and societal change.",
      "sku": "SKU12363",
      "stock_status": "Out of Stock"
    },
    {
      "id": 20,
      "title": "The Picture of Dorian Gray",
      "author": "Oscar Wilde",
      "price": 29.50,
      "image": "img/The Picture of Dorian Gray.jpg",
      "category": "Classic",
      "description": "Dorian Gray remains eternally youthful while his portrait ages, reflecting the consequences of his hedonistic lifestyle. *The Picture of Dorian Gray* explores vanity, corruption, and the corrupting power of indulgence.",
      "sku": "SKU12364",
      "stock_status": "In Stock"
    },
    {
      "id": 21,
      "title": "The Secret Garden",
      "author": "Frances Hodgson Burnett",
      "price": 17.99,
      "image": "img/The Secret Garden.jpg",
      "category": "Children's",
      "description": "A young orphan discovers a hidden, magical garden that helps her heal. As she nurtures the garden, it reflects her own transformation, helping her form deep relationships with those around her.",
      "sku": "SKU12365",
      "stock_status": "In Stock"
    },
    {
      "id": 22,
      "title": "The Outsiders",
      "author": "S.E. Hinton",
      "price": 10.50,
      "image": "img/The Outsiders.jpg",
      "category": "Young Adult",
      "description": "A novel about teenage rebellion, friendship, and the struggle for belonging, *The Outsiders* follows Ponyboy Curtis and his gang of friends as they navigate the tensions between social classes and find meaning in their lives.",
      "sku": "SKU12366",
      "stock_status": "In Stock"
    },
    {
      "id": 23,
      "title": "Little Women",
      "author": "Louisa May Alcott",
      "price": 8.99,
      "image": "img/Little Women.jpg",
      "category": "Classic",
      "description": "The coming-of-age story of the four March sisters during the Civil War, *Little Women* explores themes of family, love, sacrifice, and personal growth as the sisters each find their own paths to happiness.",
      "sku": "SKU12367",
      "stock_status": "Out of Stock"
    },
    {
      "id": 24,
      "title": "The Bell Jar",
      "author": "Sylvia Plath",
      "price": 11.49,
      "image": "img/belljar.jpeg",
      "category": "Psychological Fiction",
      "description": "A powerful novel about mental illness, depression, and self-doubt, *The Bell Jar* chronicles the life of Esther Greenwood as she grapples with her mental health while navigating societal expectations and personal struggles.",
      "sku": "SKU12368",
      "stock_status": "In Stock"
    },
    {
      "id": 25,
      "title": "The Shining",
      "author": "Stephen King",
      "price": 14.99,
      "image": "img/The Shining.avif",
      "category": "Horror",
      "description": "A chilling horror novel about a family isolated in a haunted hotel, *The Shining* delves into psychological terror as Jack Torrance's descent into madness threatens the safety of his wife and son.",
      "sku": "SKU12369",
      "stock_status": "Out of Stock"
    },
    {
      "id": 26,
      "title": "The Logic of Man and the Logic of God",
      "author": "Mostafa Mahmoud",
      "price": 18.00,
      "image": "img/The Logic of Man and the Logic of God.jpg",
      "category": "Philosophy",
      "description": "A philosophical exploration of the relationship between logic, religion, and human reason. Mostafa Mahmoud reflects on the nature of knowledge, the human quest for truth, and the alignment of faith with reason.",
      "sku": "SKU12375",
      "stock_status": "In Stock"
    },
    {
      "id": 27,
      "title": "The Quran and the Bible",
      "author": "Mostafa Mahmoud",
      "price": 20.00,
      "image": "img/The Quran and the Bible.jpg",
      "category": "Religious Studies",
      "description": "A comparative study of the Quran and the Bible, analyzing their similarities and differences. Mostafa Mahmoud offers a critical examination of the two texts and their roles in shaping the world's religious beliefs.",
      "sku": "SKU12376",
      "stock_status": "In Stock"
    },
    {
      "id": 28,
      "title": "Man and His Destiny",
      "author": "Murtaza Mutahhari ",
      "price": 16.50,
      "image": "img/Man and his destiny.jpg",
      "category": "Self-Help",
      "description": "An exploration of the meaning of life and the individual's role in shaping their destiny. This book helps readers understand their purpose and guides them in creating a meaningful, fulfilling life.",
      "sku": "SKU12377",
      "stock_status": "Out of Stock"
    },
    {
      "id": 29,
      "title": "A Journey Through Life",
      "author": "Mostafa Mahmoud",
      "price": 17.99,
      "image": "img/journey.jpg",
      "category": "Biography",
      "description": "The memoir of Mostafa Mahmoud, recounting his experiences and reflections throughout his life. The book provides insights into his intellectual and spiritual growth, exploring his journey of discovery and understanding.",
      "sku": "SKU12378",
      "stock_status": "In Stock"
    },
    {
      "id": 30,
      "title": "The Universe and Beyond",
      "author": "Mostafa Mahmoud",
      "price": 19.00,
      "image": "img/The Universe and Beyond.webp",
      "category": "Science",
      "description": "A deep dive into the mysteries of the universe, its creation, and the future of humanity. Mahmoud explores the nature of existence, the cosmos, and our place in the grand scheme of things.",
      "sku": "SKU12379",
      "stock_status": "In Stock"
    }
  ]